fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430345.txt
## 2024-04-06_19:05:54=>start-perf-test
## 2024-04-06_19:05:54=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430345     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 29913.251570 records/sec (29.21 MB/sec), 817.64 ms avg latency, 1168.00 ms max latency, 840 ms 50th, 1083 ms 95th, 1157 ms 99th, 1167 ms 99.9th.
## 2024-04-06_19:05:58=>end-perf-test