fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430381.txt
## 2024-04-06_19:06:22=>start-perf-test
## 2024-04-06_19:06:22=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430381     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 73909.830007 records/sec (72.18 MB/sec), 259.93 ms avg latency, 358.00 ms max latency, 263 ms 50th, 338 ms 95th, 353 ms 99th, 358 ms 99.9th.
## 2024-04-06_19:06:24=>end-perf-test