fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430387.txt
## 2024-04-06_19:06:29=>start-perf-test
## 2024-04-06_19:06:29=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430387     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 46082.949309 records/sec (45.00 MB/sec), 407.05 ms avg latency, 676.00 ms max latency, 376 ms 50th, 604 ms 95th, 660 ms 99th, 675 ms 99.9th.
## 2024-04-06_19:06:32=>end-perf-test