fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430398.txt
## 2024-04-06_19:06:40=>start-perf-test
## 2024-04-06_19:06:40=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430398     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 56818.181818 records/sec (55.49 MB/sec), 324.81 ms avg latency, 480.00 ms max latency, 330 ms 50th, 430 ms 95th, 462 ms 99th, 479 ms 99.9th.
## 2024-04-06_19:06:43=>end-perf-test