fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430412.txt
## 2024-04-06_19:06:53=>start-perf-test
## 2024-04-06_19:06:53=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430412     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 78369.905956 records/sec (76.53 MB/sec), 250.74 ms avg latency, 356.00 ms max latency, 257 ms 50th, 328 ms 95th, 348 ms 99th, 355 ms 99.9th.
## 2024-04-06_19:06:55=>end-perf-test