fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430460.txt
## 2024-04-06_19:07:41=>start-perf-test
## 2024-04-06_19:07:41=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430460     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 90415.913201 records/sec (88.30 MB/sec), 210.81 ms avg latency, 291.00 ms max latency, 214 ms 50th, 269 ms 95th, 284 ms 99th, 290 ms 99.9th.
## 2024-04-06_19:07:43=>end-perf-test