fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430516.txt
## 2024-04-06_19:08:37=>start-perf-test
## 2024-04-06_19:08:37=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430516     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 79744.816587 records/sec (77.88 MB/sec), 242.70 ms avg latency, 321.00 ms max latency, 243 ms 50th, 302 ms 95th, 310 ms 99th, 319 ms 99.9th.
## 2024-04-06_19:08:39=>end-perf-test