fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430646.txt
## 2024-04-06_19:10:48=>start-perf-test
## 2024-04-06_19:10:48=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430646     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 55555.555556 records/sec (54.25 MB/sec), 348.09 ms avg latency, 529.00 ms max latency, 348 ms 50th, 515 ms 95th, 524 ms 99th, 528 ms 99.9th.
## 2024-04-06_19:10:50=>end-perf-test