fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430713.txt
## 2024-04-06_19:11:54=>start-perf-test
## 2024-04-06_19:11:54=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430713     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 84033.613445 records/sec (82.06 MB/sec), 218.21 ms avg latency, 311.00 ms max latency, 214 ms 50th, 298 ms 95th, 308 ms 99th, 310 ms 99.9th.
## 2024-04-06_19:11:56=>end-perf-test