fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430842.txt
## 2024-04-06_19:14:04=>start-perf-test
## 2024-04-06_19:14:04=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430842     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 84817.642070 records/sec (82.83 MB/sec), 218.86 ms avg latency, 310.00 ms max latency, 222 ms 50th, 292 ms 95th, 306 ms 99th, 309 ms 99.9th.
## 2024-04-06_19:14:06=>end-perf-test