fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430907.txt
## 2024-04-06_19:15:08=>start-perf-test
## 2024-04-06_19:15:08=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430907     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 87108.013937 records/sec (85.07 MB/sec), 211.00 ms avg latency, 303.00 ms max latency, 220 ms 50th, 274 ms 95th, 294 ms 99th, 302 ms 99.9th.
## 2024-04-06_19:15:10=>end-perf-test