fs24-mc1-etiiiR/Part2/SmartCity/Limit Bench/output/benchmark-producer-1712430972.txt
## 2024-04-06_19:16:13=>start-perf-test
## 2024-04-06_19:16:13=>/usr/bin/kafka-producer-perf-test --topic benchmark-r2-p2-1712430972     --num-records 100000     --record-size 1024     --throughput -1     --producer-props acks=1 compression.type=none bootstrap.servers=kafka1:9092,kafka2:9092,kafka3:9092 
## 100000 records sent, 93632.958801 records/sec (91.44 MB/sec), 201.60 ms avg latency, 267.00 ms max latency, 207 ms 50th, 247 ms 95th, 261 ms 99th, 266 ms 99.9th.
## 2024-04-06_19:16:15=>end-perf-test